{
  "title": "Jan 28 2017 John Carney -- Once & Begin Again",
  "cells": [
    {
      "type": "text",
      "data": "前一段时间因为糊里糊涂的结束了一段关系 心里面有一段时间一直感觉空落落的 于是看了两部John Carney 虽然已经记不起来当时为啥要看 但是趁着在家一并写写吧。<div><br></div><div>两部都是爱情和音乐为主题的电影 无非是男女因为音乐找到了自己的知己的故事 情节也并不复杂。</div><div>Once里面的男主角是导演拍电影之前所在乐队的主唱 在电影里面的设定是一个落魄的修理<br><div><br></div><div>Begin Again 的故事</div></div><div>Keira Knightley演的Gretta和男朋友Adam Levine演的Dave是两个年轻的英国音乐人 因为一首Gretta创作Dave唱的电影插曲被一个美国的唱片公司赏识 两人从英国来到美国。刚来的时候唱片公司以为那首歌完全是Dave的创作 虽然Dave在见面会上说了Gretta不仅仅是他女朋友 也是他创作上的伙伴 但是Gretta大度的表示她对于她的角色无所谓。（其实说明了一开始并没有正式注明那首歌和Gretta的关系 为后面Dave改变Lost stars埋伏笔）</div><div>他们在纽约有了一个很大很好的公寓 甚至还可以在里面打篮球和乒乓球 看起来他们也都很喜欢很享受纽约。Dave虽然刚刚崭露头角 但是已经有了不错的观众基础 看起来一切都那么美好。虽然Gretta看起来没有什么“正经”的职业 但是每天在录音棚里面给大家买买咖啡 骑着自行车晃晃也并没有那么单调。事情的转折出现在Dave去LA的一次巡演 Gretta并没有过去 回来之后Dave问Gretta是不是有兴趣听自己写的新歌 Gretta欣然应允 然而Gretta听着那首歌觉得里面表达的情感很不一般 在她望向Dave的时候 看到也不是迎上来的充满爱意的眼神 而是Dave左顾右盼的躲避。事情已经很明显了 于是Gretta抬手就给了Dave一巴掌 Dave一下子愣住了 打了酒杯走出厨房 然后走回来靠在门上说了一句 You are a fucking mind reader。 原来那首歌是写给公司里面的一个助手的（一个亚裔妹子）他在去LA的tour上出轨了。</div><div>Gretta伤心欲绝 于是去找之前在街头认识的一个卖唱的胖子 胖子收留了她 胖子晚上要在酒吧唱歌 怕Gretta在家一个人太难受 于是拉着Gretta去酒吧和他一起 唱完了之后又拉着Gretta唱了一首A step you cannot take back。 唱者无心 听者有意 台下Mark Ruffalo扮演的Daniel是一个落魄的音乐制作人 虽然很有才华对于艺术嗅觉灵敏 但是对于商业并不十分在行 并且有着有天赋的艺术家常有的自负傲慢 在台下的他被排挤出了自己创立的音乐制作公司 家庭也濒临破碎 本来的目的是来酒吧喝完之后就去我轨自杀 但是在Gretta的音乐里听出了不同的味道 觉得Gretta的音乐大有可为 于是过来要签Gretta 但是Gretta对于这些并不感兴趣 一方面是因为后面她自己说的那样她写歌是for her pleasure and for her cat 另外一方面这个时候她处在一个对于事情比较逃避的状态 只希望过完这天然后就回英国 离开纽约这个伤心之地。</div><div>经过一晚上的考虑 Gretta决定还是给Dan打个电话 说自己决定和他一起做一张唱片 Dan一开始的时候还开玩笑说 Who is it? 知道了Gretta的决定之后 Dan也很兴奋 于是跑回了前妻的家里 要前妻找一个好的suit给他 还让前妻找剃须刀给他。 前妻抱怨说 我们之前有约定的 你不能就这样进来 Dan说我找到了我喜欢的音乐 所以我要收拾的精神一点。 前妻Marie表示很开心 也很顺从的给他找了suit和razor 可以看出来Dan并没有搬出去很久 而且两个人已经有太多生活上的默契了。</div><div>Dan带着Gretta见了自己的合伙人 本来以为Gretta至少有自己的Demo 但是事实上Gretta什么也没有 于是只好现场给合伙人唱了一遍A step you cannot take back 合伙人对于Dan这么天马行空的想法并没有很高的热情 但出于对于自己partner的了解 表示你们先做出来我们再看看。</div><div>得不到公司的支持 很多事情就变的复杂起来 不能预付乐队工资 于是只好一部分表示时候给 一部分是凭借之前自己的关系 一个黑人大哥 给的钱。而且也没有钱找专业的录音棚 只好在各种室外的场合 用很简陋的装备录音 数的出来的各种场景有破败的小巷口唱的hold on 地铁里 天台上 公园的船上。Dan的女儿和妻子也参与了进来 Dan的女儿作为吉他手 Dan作为贝斯手参与了录制 终于大功告成。</div><div>在后面的轻功party上 Gretta给Dan倒了一杯香槟但是之前经常借酒浇愁的Dan却拒绝了 喝了口Pepsi然后抱怨世界上为什么会有人和这个东西。散伙之后Gretta看着Dan载着一家离开 眼里是满满的羡慕。于是回来不久就又去见了自己的前男友Dave Dave在背叛了Gretta之后其实过得也不是那么好 在听到Gretta写给他的like a fool之后意识到自己还爱着Gretta 于是恳求Gretta能原谅自己 Gretta这时候并没有原谅Dave 但是还是见了他 Dave给她听了自己获奖的新专辑 其中有一首改编过的Lost stars Gretta非常的不开心 一方面是因为觉得这首歌是他们两个人私人的东西 是当时自己送给Dave的礼物 不应该改编来卖钱；另外一方面是因为觉得Dave为了迎合观众的胃口 改变了很多这首歌的初衷和韵味。Gretta差点就要和Dave吵了起来 但是突然意识到他们现在已经不是男女朋友也不是合作伙伴了 自己没有什么和Dave争执的立场了 于是心里很郁闷的Gretta想要起身离开。Dave挽留她说希望她去听自己周六的演唱会（歌友会）Gretta没有答应也没有拒绝。但是到了周六之后还是没有忍住去了Dave唱歌的那个地方 Dave在唱Lost Stars之前介绍说 这是一首对自己很特别的的歌 希望观众能加入进来一起。Dave这次对于这首歌的演绎和之前给Gretta听的专辑里面的歌很不一样 少了很多Stadium 更加贴近Gretta本身的创作意图Ballot 对于Dave表达出来的诚意Gretta很感动 但是随着歌曲的进行 尽管Dave仍然尽力在音乐风格上讨好着Gretta 但是Gretta还是能感受的到如今的Dave已经不是当年的Dave了 有些事情的确走了就回不来了。<span style=\"line-height: 1.4;\">于是Gretta擦干了眼泪 一个人在纽约的街头骑着车徜徉。</span></div><div><span style=\"line-height: 1.4;\">结尾Gretta去找Dan 决定把已经录好的唱片用一美元的价格公开放到网上 然后Dan回到了自己的妻子和女儿身边 Gretta也收拾心情 重新开始了自己的历程。</span></div>"
    }
  ]
}