{
  "title": "Feb 18 2017  还不想结束",
  "cells": [
    {
      "type": "text",
      "data": "昨天晚上 突然又开始很想念WXY 很想知道她现在怎么样 猜到她有可能在玩LOL 但是我的LOL账号已经被她删掉了 于是就去op.gg搜 然后发现他之前一直和一个账号玩 几乎所有的游戏都有另外一个人在 反过来那个人自己倒是有时候也会自己玩。所以想想大概就是一个对她有求必应的汉子吧。然后发现op.gg 可以看他们打比赛 即使不是我的好友 很贱的看了几盘之后。 没忍住又给她发了一条长长的微信 说我有多么不舍得 有多么后悔 多么希望她能再给我一次机会。看到她没有回我 于是就心急火燎的开车到了她家 透过百叶窗 看到她穿着睡衣和一个汉子 边视频边打游戏 有说有笑。觉得这样狗血的剧情只会在电视剧里出现 但是这次真的真真切切的发生了在我的身上。"
    },
    {
      "type": "text",
      "data": "于是告诉她 我在门口 我想见见她 我不想就这样错过她 但是真的我从来没有见过那么坚决的她 她说我不会给你开门的 我也不会再给你机会了。每句话都像一把刀戳到心上 但是我什么也做不了 凌晨四点的austin真的不算是暖和 很快我就有点发抖了 然而这点寒意比起心里的悲哀只是九牛一毛。不过知道了她很快有了新欢 有一个能让她无所顾忌的说话开怀大笑的人 也是挺好的。虽然现在我已经很难做到去真心诚意的祝福她了 但是也远远犯不上诅咒。只是这样表明这段前后两年的关系 终于走到了尽头。&nbsp;"
    },
    {
      "type": "text",
      "data": "<span style=\"font-size: 14px;\">我们之间的问题</span><div style=\"font-size: 14px;\">从我的角度来看 影响我们之间长期关系的问题是 因为家庭和受到教育的不一样 对于以后生活的规划差距太大了。我也不是那种特别有野心的人 但是还是觉得人生在世几十年 如果不能live to the full 实在是有点浪费。但是她觉得人这一辈子嘛 当然要怎么舒服怎么来。因为她已经很有钱了 而且也期望以后自己的男朋友和丈夫 能够承担家里面的大部分开销 这样她就可以安心的做一个不工作的人 家务丈夫当然也要分担。从我的角度来说 我觉得因为女生/女人在社会上仍然受到很多显性隐性的歧视 加上还要生孩子 男人在家务和家庭开销多承担一些也是很自然的事情 但是不是她爸爸那样房子也都只是母女的名字没有自己的名字 平时像养宠物一样。当然这个也不是我push她找工作的原因 因为很多时候我对于未来 特别是未来的变故 是一个很悲观的人 我希望即使以后我不能照顾我的另一半了 或者我的另一半的家庭出现了很多问题 她至少也能保证基本的生活质量。</div><div style=\"font-size: 14px;\"><br></div><div style=\"font-size: 14px;\">当然除了这些深层次的问题 导致我们分手的其实还是主要是相处上面的问题。这个上面我有很多很多需要反思的地方 尽管我求她的时候说自己很后悔 但是我并不。我的问题主要在于 在谈恋爱的时候 没有给她足够的关心和投入 也没有给她希望 自己很多时候还很玻璃心。</div><div style=\"font-size: 14px;\">具体说起来 就是平时虽然自己觉得很多地方在让着她 但是这个只是没有扣分而已 在计划如何在平淡的生活里面加一些漂亮的点缀 做的非常的不好。小礼物啊 一次计划好的旅行啊 想办法去给她拍好看的照片啊 本来应该一起去营造的活动很少很少 当然这个一部分原因是 我和她的兴趣爱好差距实在是有点大。（这个地方还是要说明一下 其实我的很多兴趣也不是那么强烈的兴趣 我大体上还是一个生活比较单调的人 所以以后如果跟别的妹子在一起 只要不太过分的话 就出心出力的去理解她的兴趣爱好 没准自己以后也会爱上这项活动。 说来讽刺 我们大概唯一真正的共同爱好就是LOL了 然而这个大概是她现在和现任如胶似漆的重要原因之一）另外的特别的日子啊 节日啊 都要记在心上 让她知道和我在一起 我并没有觉得理所当然 我很珍惜我们在一起的时间 那些过去的日子对于我真的意味着很多。计划好的旅行 尽量安排好自己的时间 出心出力的计划好行程 锻炼自己的拍照技巧。</div><div style=\"font-size: 14px;\">在于对于以后的期望上 很多时候他们需要的真的也不是 白纸黑字言之凿凿的合同 他们需要的是一种状态的表示和一种对于未来的期望。比如说我们逛首饰店的时候 就可以说 等我们有钱了 哪个好看那那个 不看价钱 或者说 哪个石头大挑哪个。（现在想想那些试图说服女朋友钻石仅仅是营销的人 真的是傻到家了。）比如在一起想想以后想买什么样子的房子 想怎么装修自己的家 还有那些。 这些想象并不是承诺 因为这些事情都是有条件的 等我们有钱了买大钻石 如果我们的经济允许的话买mansion之类的。</div><div style=\"font-size: 14px;\">关于玻璃心 这个自己做的并不算好 但是从我的角度来看 很多也是她带的节奏。刚开始的时候 我说话稍有不慎 就会被抓住把柄 后来学乖了 不会轻易被她抓住把柄了 但是自己对于她说的话 也开始挑剔起来。（现在有很多人 真的不是很会聊天 可能再别人眼里面 我也是这样的人吧。）不要玻璃心不要玻璃心不要玻璃心。要包容要包容要包容。</div>"
    },
    {
      "type": "text",
      "data": "我到底希望和什么样的人度过一生<div>长得不错 双商不错 三观没有太大差别 在一起比各自一个人的时候生活更有趣<span style=\"line-height: 1.4;\">&nbsp;</span><span style=\"line-height: 1.4;\">能换位思考能体谅对方的想法和难处&nbsp;</span><span style=\"line-height: 1.4;\">出问题的时候能平心静气的讨论解决办法; 正式确立关系之后生活习惯没有不可调和的差距 能互相信任包容 愿意一起享受生活的美好 也愿意一起承担生活的重担。</span></div><div><span style=\"line-height: 1.4;\">一些加分的特点</span></div><div><span style=\"line-height: 1.4;\">骨架小不干瘦当然也不能胖 声音细 鼻子挺 胸不是很大 聪明但是不算计我 很努力</span></div>"
    },
    {
      "type": "text",
      "data": "<span style=\"font-size: 14px;\">现在我要做什么</span><div style=\"font-size: 14px;\">这么分析下来 WXY和我真的不合适 所以真的很感谢她狠下心跟我分手 即使我解决了相处里面的很多问题 也不过是把恋爱时的关系处的比较融洽而已。我很爱她 所以失去她我很伤心 我会低声下气的不顾尊严的去求她 即使只是吃闭门跟。但是出于对我自己的尊重和对于她的生活的尊重 她并不是我希望一起过一辈子的人 就像上面说的根本的问题没有解决 剩下的即使恋爱的关系经营的很好 恐怕也很难长久。（这里有另外一个值得说的事情 就是我在这段关系里面 很多时候想的很远很保守 觉得自己是对她好 但是注意了 如果她觉得我是对她好的话 我可以耐心的说说 如果真的是三观的差别 那么也就不要试着输出价值观了 如果这个事情无伤大局就包容接受 如果不能的话 怎的就要考虑这段关系到底是不是应该继续了。）</div><div style=\"font-size: 14px;\">我要做的事情 做好生活作息的规划 工作上和学校的事情打理好 每天健身 找教练学游泳 自己信得过的几个朋友好好聊聊 结交一些新朋友</div>"
    }
  ]
}