{
  "title": "June 10 大概是来美国之后压力最大的时候了",
  "cells": [
    {
      "type": "text",
      "data": "&nbsp; &nbsp; &nbsp; &nbsp; 上个周末自己还在不知天高地厚地计划着暑假的出行， 但是这周一老板就把我叫过去， 表示我已经在probation了。 事情来得很突然。 但是也不是毫无预兆， 自己之前的几个月的确是干得不是很好。 而且大概里面最不好的部分就是： 很多时候Joel明明已经说得很清楚的事情， 我却不能不打折扣的完成。 换句话说就是， 他们也并不是对我没有耐心， 觉得我短期之内不能达到他们的预期就赶我走。 更多的时候我觉得是Joel可能觉得有我在， 不仅没有帮助解决问题， 反而给他增添了很多不必要的烦恼。 如果情况是这样的话， 换做是我， 我也会很想摆脱这个人。 但是好消息是， 尽管不知道他们是不是已经有了最后的决定， 但是至少现在纸面上， 我只是收到了probation的通知，还没有真正到termination of employment的地步。 不过话又说回来， 就像我之前说的， 尽管现在他们只是跟我说我在probation， 但是也有可能他们已经做出了最后的决定。"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; &nbsp; &nbsp; 客观上分析的话， 这三四个月我的确不算是过得很好。无论是上学期学校里面的糟心事儿， 因为王倖瑶很多时候没有办法几种精力， 加上最近外婆的身体状况很糟糕， 有可能很快就会不久于人世。 但是这些都不是理由， 因为我知道也只有我知道， 我在很多时候在想什么， 只有我知道我之前的时间和精力是怎么分配或者荒废掉的。 之前几个月里面我觉得我心思花的最多的地方应该是， 一直在想和王倖瑶复合和找一个白人女朋友之间摇摆。 中间穿插着一些其它的对自己的未来缺乏责任感的想法。 总体来说， 无论是前面的那种想法， 当我主要的心思在这个上面的时候， 我处于一种很恍惚的消极状态。 其实回过头来看， 那段时间自己过得并不算是轻松， 但是无论从哪个方面来看， 自己都过得很没有质量。 没有结交到更多的朋友， 没有成功的和王倖瑶复合（当然这个不一定是我努力不够， 很有可能我做什么她都不会回来了）， 也没有在自己的工作上面有足够质量和数量的产出。&nbsp;"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; &nbsp; &nbsp; 所以说现在面临这个情况， 我觉得无论如何， 对于我调整状态提高水平都只有好处没有坏处， 只不过客观的来说， 如果自己这段时间不能很快提高然后达到或者至少基本达到Joel和公司的预期的话， 可能就会很快偏离自己之前半年到一年时间里面设想的职业发展的路线。 我知道对于我来说， 偏离自己的设想很多时候并不一定是一件很糟糕的事情， 但是我是一个骄傲的人啊。 我不愿意被别人强迫改变我的计划和设想。 而且客观上来说， 我在HRT很有可能会学到不少东西。 从现在的情况来看， 对于个人品牌的建立， 也应该是一个非常不错的选项。"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; &nbsp; &nbsp; 之前和任作成聊起来这个事儿， 一方面觉得有一些年长一些的朋友的确是一件很好的事情。 虽然不是说交朋友就是为了这些时候能帮上自己的棒， 但是觉得和他聊起来真的帮我厘清了很多之前自己不是很清楚的事情。 最重要的一件事情就是， 公司对于每个人或者说每个level的人， 都是有对应的expectation的。 自己干得好干得不好， 说到底不是老伴开心不开心， 而是自己有没有达到公司对自己的期望。 从另外一方面说就是，对于现在的我来说，可能仅仅做到之前在Joel提到的地方有所改善已经不是很够了。 想要留下来的话， 很有可能需要达到甚至超过当时他们把我招进来的expectation。 这个就是我后面在probation阶段需要做到的事情。&nbsp;"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; &nbsp; &nbsp; 关于在probation阶段的具体的计划 &nbsp; &nbsp;<div>&nbsp; &nbsp; &nbsp; &nbsp; 如果想要pass probation， 我觉得一句话的概括就是“超过或者至少接近达到公司招我进来的时候的expectation”。 我现在对于这个的理解是：</div><div><br></div><div><ol><li>对于别人的comments 和 feedback 能够比较可靠的resolve。<br></li><ol><li>对于别人想要表达的意思 一方面自己要非常仔细的阅读 另外一方面要在提交结果之前 找机会clarify<br></li><li>对于自己的工作要足够负责， 别人提出了comment和feedback， 自己有责任尽自己最大努力的完成好。<br></li></ol><li>对于交给自己的事情， 能够用reasonable的时间， 交出reasonable的结果&nbsp;<br></li><ol><li>对于自己不熟悉的领域的 research 学习 和 工作计划的制定<br></li><ol><li><font color=\"#323232\" style=\"background-color: rgb(254, 250, 0);\">带着清晰的目标， 快速有效率的阅读文档；（需要足够的专注程度和足够的耐心）</font></li><li>对于可能的实现方式 一直在心里面要有一个比较清晰的框架 在不工作的时候 可以理一理自己手头的活儿；</li><li>在开始research之前， 想一想这样的事情Joel的期望的完成的时间是多少，自己在这方面有多rusty， 需要多大程度的加班。</li></ol><li>自己做proof read， 代码的可读性， 数据结构的选择 （用别人实现好的功能， 还是从头开始 包括在上一条）；<br></li><ol><li>自己之前这个做的不是很多， 但是其实感觉就像帮别人改作文一样， 这样的事情对于我来说并不陌生/困难。</li><li>这个部分， 这个部分是提高自己的水平很关键的部分，test这种事情很重要， 但是对于自己水平的提高很有限；最好的结果当然是自己读自己写的这段代码的时候， 心里就已经跑了很多的tests， 后面真正的testing只不过是为了validate和向别人证明自己的确考虑到了而已。</li></ol><li>test 自己的代码；</li><ol><li>对于现在自己在做的类似于tools的工作，设想可能的使用场景， collect enough ideas before actual testing；</li><li>对于以后可能做的对于现有的系统做修改的工作， 测试自己做的改变， write tests to cover all the changes I have made。</li></ol><li>present 自己的工作，如何让Joel或者其它的reviewer更快更好的了解自己的意图和实现。</li><ol><li>现在感觉自己并没有什么特别要说的事情在这个上面， 以后慢慢添加吧。</li></ol></ol></ol></div>"
    },
    {
      "type": "text",
      "data": ""
    },
    {
      "type": "text",
      "data": ""
    }
  ]
}